[{
	"title": "FPL Rate My Team Surgery with five-time top 1k finisher Tom Freeman",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-rate-my-team-surgery-with-five-time-top-1k-finisher-tom-freeman-43/",
	"text": "\nWith another Gameweek of Fantasy Premier League (FPL) starting on Saturday, five-time top 1k finisher Tom Freeman is here to help with your pre-deadline dilemmas for the next hour. Whether it’s questions on Arsenal and Manchester City players, the forthcoming Blank Gameweeks or anything in between, Scout’s Deputy Editor will tackle whatever’s thrown at him. Tom will be on hand to first reply to requests from \nin the\nHot Topic below the line of this piece and will get through as many as he can until the next article goes up. If there’s time, Tom will also turn his attention to other requests in the comments section. You can, as ever, chip in with your own opinions on the RMT requests filtering through – and naturally, you’re free to ignore the article subject matter and talk about any other wider FPL topics that you’d normally be musing on. Don’t forget that, if it’s an algorithmic answer you’re after rather than an opinion-based one, we also have a \navailable in the Premium Members Area. Posted by"
}, {
	"title": "FPL Double Gameweek 27 confirmed for Brighton, Brentford, Palace + Soton",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/double-gameweek-27-confirmed-for-brighton-brentford-palace-soton/",
	"text": "\nFour teams will play twice in Double Gameweek 27 of Fantasy Premier League (FPL) after the rearrangement of two previously postponed fixtures. Brentford, Brighton and Hove Albion, Crystal Palace and Southampton are the clubs involved, with their new Gameweek 27 schedules as follows:\nBrentford’s double-header immediately catches the eye, with both opponents currently inside the Premier League’s bottom three. Brighton, meanwhile, face a trip to Elland Road before hosting rivals Crystal Palace, who they happen to meet on Saturday in the reverse fixture. However, it’s worth noting both sides will blank in Gameweek 25, due to Newcastle United and Manchester United’s involvement in the EFL Cup final. That will temper any immediate enthusiasm, although as soon as that blank passes, expect interest in the likes of \n (£7.7m) – providing he is still available – and \n (£5.2m) to pick up. At that stage, the status of Blank Gameweek 28 will be clearer, too. As it stands, Brentford, Brighton and Southampton’s fixtures are all at risk of being postponed. Mitoma’s stock will only rise but Brighton could potentially face the following schedule, making it extremely difficult for FPL managers to navigate. As for Crystal Palace and Southampton, it’s unlikely their assets will be afforded too much attention given their schedules, unless they can quickly find some form. Posted by"
}, {
	"title": "FPL Double Gameweek 23: Goalscorer and clean sheet odds",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-goalscorer-and-clean-sheet-odds/",
	"text": "\nThe anytime goalscorer odds are based on the assumption that the player starts, so \n (£12.2m) is top with a 66% chance of netting anytime over his two games. Aston Villa are up first for him, who have conceded 20 big chances since Gameweek 17 – they cannot afford to let any fall to Haaland. (£6.8m) has a 53.5% chance and \n (£8.3m) is on 39.5%. Only Haaland himself has registered a higher expected goals (xG) total than Nketiah since Gameweek 17, with 4.86 slightly behind 5.07. Following the Premier League’s announcement of Double Gameweek 25, managers need to be tripled up on Arsenal assets and it’s a week where Manchester City participate, while Brighton and Hove Albion, Brentford, Manchester United and Newcastle United do not. So you can buy some extra short-term fixtures with smart transfers such as \n (£7.7m) to Nketiah or \n (£5.7m) to \n (£7.0m). (£12.7m) and \n (£8.7m) aren’t to be bought this week, given the Double Gameweek prioritisation, but are among those confirmed to have a Double Gameweek 25, so we’ve got a couple of weeks to assess them. There could be an upturn in form once \n (£8.0m), \n (£8.8m) and \n (£6.5m) return, which times perfectly with the double. The question is what to do with \n (£6.6m), who is given a 38.5% chance of scoring but could be prone to more substitutions with \n (£6.7m) around, like at Everton last weekend. He didn’t even reach 60 minutes. For me, it’s very justifiable to move Martinelli on to Odegaard or Saka, even for a four-point hit. Having two doubles over the next three means making sure you’ve got the right players. The picture is clearer with Arsenal, whereas picking the best Man City trio is murkier. (£7.7m) has a 47% chance of scoring and perhaps he’s the one, given his recent form, though he also was an early substitution victim last week. Although \n (£12.4m) was benched at Spurs, I’d back him to start both matches and he’s my favourite after Haaland. One problem is that, if you don’t own him and pick him up now, you may only get two Gameweeks out of him before selling for Salah in Gameweek 25."
}, {
	"title": "FPL Double Gameweek 23: Goalscorer and clean sheet odds",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-goalscorer-and-clean-sheet-odds/",
	"text": "One problem is that, if you don’t own him and pick him up now, you may only get two Gameweeks out of him before selling for Salah in Gameweek 25. Fine if the rest of your team is set up well but one to weigh up if you’ve got bench issues to work on beforehand. For the clean sheet odds, Man City and Arsenal are backed to keep at least one clean sheet, with 64.8% and 60% respectively. You’d back the champions to do it versus Aston Villa, as Arsenal host Brentford. (£4.7m) is the eighth top-scoring defender. Although it could be a concern that he is sometimes withdrawn early, this can be a good thing for defenders if it locks in the clean sheet. Yet we’ve also seen a substitution before 60 minutes. Performance levels have dipped slightly in recent games, so \n (£4.2m) could get a start at some point. That said, if you’re a White owner, you probably stick with him for now. The best pick in my eyes is \n (£5.2m), who is completely nailed and carries a goal threat. This season, he’s top amongst all defenders for xG, scoring twice this season after the five of last time. There’s not much between him and \n (£5.3m), though. Left-back \n (£5.1m) has been outstanding and is also worth some thought for £5.1m, though again perhaps there’s a small chance of some \n (£4.6m) instead. They are very different types of defenders though, as Zinchenko cuts inside to overload central midfield, while Tierney is a more traditional attacking full-back that stays wider and gets down the wing. Newcastle have a 47% chance of a clean sheet at Bournemouth. It’s their last good fixture for a while, depending on how you view Liverpool (H). Then it’s Blank Gameweek 25, before visiting Man City. Despite that, there’s quite rightly been no discussion on selling the incredible value of \n (£6.1m). If you own the \n (£4.6m) and \n(£4.0m) pair, it’s Kepa getting the nod this week, with a 34% chance of success compared to Ward’s 21%. This week’s top transfer is actually \n (£5.2m) after 280,000 transfers in."
}, {
	"title": "FPL Double Gameweek 23: Goalscorer and clean sheet odds",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-goalscorer-and-clean-sheet-odds/",
	"text": "This week’s top transfer is actually \n (£5.2m) after 280,000 transfers in. In isolation, he’s a great pick after delivering four goals and an assist over his last five matches. However, without a Double Gameweek 23 before his blank in 25, it’s not the week to buy him unless the rest of your team is perfect. After Mitoma, a lot of reasonable transfers have taken place. Saka has been picked up by 205,000, with seven goals and eight assists alongside the appeal of being nailed on and having penalty duties. If you can only pick one of Odegaard and Saka, I’d lean towards Odegaard due to the price difference. Post-restart, Saka leads 2-0 on big chances but Odegaard is 4-1 up for big chances created and has a better expected goal involvement (xGI, 2.91 v 2.79). Over the season, xGI is still very close – 9.4 for Saka but 9.7 for Odegaard. It’s also worth keeping Gameweek 25’s captaincy in the back of your mind, with Salah or an Arsenal player being the obvious picks. Saka’s been widely discussed for the armband but is only on one double-digit haul this season, compared to Odegaard’s six. If you own both or can get to both for this week, you’re in a very strong position. We saw a lot of FPL managers sell De Bruyne for \n (£9.9m) last week and now 105,000 have bought the Belgian. The addition of Double Gameweek 25 has altered the situation, as you could grab De Bruyne for two weeks and then sell for Salah is in good shape elsewhere, or you could skip Salah entirely. If you’re looking for a Man City defender, \n (£5.0m) could maybe be the best option if Pep Guardiola persists with the back-three formation but it is close between him and \n (£5.1m). He may deploy one of Ake or \n (£5.7m) as the left-footed centre-back, with two right-footers like Akanji and \n (£5.9m). The injury to \n (£5.4m) means one less player is competing for that position, though he could be back by Gameweek 25 and put Akanji slightly at risk. The upside with Ake is that he carries more attacking threat."
}, {
	"title": "FPL Double Gameweek 23: Goalscorer and clean sheet odds",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-goalscorer-and-clean-sheet-odds/",
	"text": "The upside with Ake is that he carries more attacking threat. Ending with the most sold players, it’s \n (£7.1m) on top again as expected. If you wish to move him to another Man City defender then Akanji and Ake are my picks, in that order, although we did see \n (£3.9m) play the full 90 last match for the first time. Almiron is the second most-sold after dropping off substantially since the World Cup. The seven matches before saw seven goals and two assists but the six after has just one goal, all the way back in Gameweek 17. Martinelli has 159,000 sales, with growing concern over Trossard’s presence. The next three Gameweeks need managers to have the exact right Arsenal assets. The frustrating Salah has been sold by 119,000 but is probably worth holding now that Double Gameweek 25 has been announced. Finally, it’s a surprise to see De Bruyne here, sold by 69,000 managers. I’d back him to start both games this week. Posted by"
}, {
	"title": "The Scout Squad’s best players for FPL Double Gameweek 23",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/the-scout-squads-best-players-for-fpl-double-gameweek-23/",
	"text": "\nAhead of Friday’s Scout Picks selection, our in-house team of Sam, Marc, Tom and Neale each put forward the Fantasy Premier League (FPL) names they think should make the cut. Our panelists submit 18-man player longlists with the focus just on the upcoming Gameweek – and with various stipulations, as detailed in the next section. Our four resident writers are solely focused on the upcoming Gameweek with their selections. Anything outside of this window, we cover in the \nThe players who get the most votes are much more likely to make the Scout Picks, although the final XI can’t exceed £83.0m – so occasionally, cheaper alternatives have to be found. Each of our writers must meet the following requirements for this feature:\nThe rest of this article is completely free to read but requires a Fantasy Football Scout account for access –\n. Neale is the Editor of Fantasy Football Scout."
}, {
	"title": "FPL Double Gameweek 23 differentials: Badiashile, Maddison + Kilman",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/09/fpl-double-gameweek-23-differentials-badiashile-maddison-kilman/",
	"text": "\nDouble Gameweek 23 of Fantasy Premier League (FPL) is fast approaching, so it’s time to have a look at some more differential options. This time, we’ve selected low-owned picks at Chelsea, Leicester City and Wolverhampton Wanderers, who we think have the potential to make an impact. As always, to qualify, the player must have an ownership of 5% or less at the time of writing. It may have gone under the radar but Chelsea have kept a clean sheet in all three of \n’s (£5.0m) appearances so far. The Frenchman has played just 270 minutes for his new club after signing from Monaco in January, yet he already looks like a shrewd acquisition, having struck up an impressive partnership with Thiago Silva (£5.5m). Prior to his introduction into the starting XI, Graham Potter’s side had kept just one clean sheet across their last eight Premier League outings. With him in the team, they have managed to shut out Crystal Palace, Liverpool and Fulham. In Gameweek 22, Fulham attacked whenever opportunities presented themselves but were repeatedly left frustrated by the host’s defensive organisation. In fact, Marco Silva’s side managed just five shots inside the box and 0.65 expected goals (xG) overall, their lowest tally in a single match since the Premier League resumed after the World Cup. Chelsea added eight players to their ranks last month, but, per UEFA rules, could only register three of these signings (Mykhailo Mudryk, Joao Felix and Enzo Fernandez) in their Champions League squad for the knockout stages, with Badiashile missing out. However, that suggests he could play a key part in their Premier League schedule, which includes guaranteed fixtures in Gameweeks 25 and 28. All is not rosy at Chelsea right now, especially in attack, but it’s worth noting they have kept seven clean sheets since Potter took charge in Gameweek 9, second only to Newcastle United’s nine. Their underlying defensive stats in the last six matches continue to improve, too, as they sit sixth for minutes per expected goals conceded (xGC). That makes Badiashile an intriguing differential pick, who can not only help FPL managers navigate the forthcoming blanks but also offer real value at £5.0m."
}, {
	"title": "FPL Double Gameweek 23 differentials: Badiashile, Maddison + Kilman",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/09/fpl-double-gameweek-23-differentials-badiashile-maddison-kilman/",
	"text": "That makes Badiashile an intriguing differential pick, who can not only help FPL managers navigate the forthcoming blanks but also offer real value at £5.0m. Having only recently returned from injury, \n (£8.0m) scored Leicester’s early equaliser at Villa Park last weekend. The 26-year-old played as a second striker at times, often joining Kelechi Iheanacho (£6.1m) in the initial press. However, he would also come short, with Brendan Rodgers’ attacking 4-4-2 formation morphing into a 4-3-3. It certainly worked, with the Foxes scoring four goals in a match for the third time this season from an impressive 2.57 xG, the most of any side in Gameweek 22 bar Man Utd, who played twice. Tete (£5.5m) and Iheanacho may have drawn most of the plaudits in Leicester’s 4-2 win, but the former’s arrival allows Maddison to move back to his preferred central position, which is arguably the key FPL takeaway from the match. Despite sometimes being used in an inverted midfield role from the right this season, Maddison is averaging 0.61 goals per 90 minutes, an impressive tally that is only beaten by six players who you’d deem regular starters (500+ minutes). He’s exceeded his xG by +4.76 (eight goals from 3.24 xG) thanks to his excellent long-range finishing, but even if that drops off, his playmaking skills can provide assists. The immediate fixtures for Leicester admittedly aren’t that appealing, but Maddison has scored in his last two meetings with Spurs. He also netted against Arsenal earlier in the season and despite blanking, racked up three shots/two created chances when the Foxes met Man Utd in September. Maddison’s return from injury has been a huge boost for Leicester, who are unbeaten in the three games he has played in 2023. Now, you’d expect them to kick on and provide real Fantasy value for the remainder of the season. Budget defender \n (£4.3m) gave his best display of the season in Gameweek 22, partnering Craig Dawson (£4.8m) at the back in Wolves’ 3-0 win over Liverpool. As a result, the Molineux outfit have now taken 10 points from the last 18 available, a decent tally for a team still acclimatising to Julen Lopetegui’s methods."
}, {
	"title": "FPL Double Gameweek 23 differentials: Badiashile, Maddison + Kilman",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/09/fpl-double-gameweek-23-differentials-badiashile-maddison-kilman/",
	"text": "As a result, the Molineux outfit have now taken 10 points from the last 18 available, a decent tally for a team still acclimatising to Julen Lopetegui’s methods. They are undoubtedly moving in the right direction under the Spaniard, with their organisation out of possession improving. In fact, they have conceded only six goals from Gameweek 17 onwards, the same number as Arsenal, whilst keeping two clean sheets. “[Lopetegui] has made massive changes, to our mentality, our way to work, to press, to be on the pitch and this was very good for us and we are very happy to work with him. Now it’s about fighting for him. We are more like warriors and we are looking for each other. They are protecting me and I am protecting my team-mates. We are more of a family and we are giving all for our team-mates, and this is very important because we are showing character, and we like this.” – Jose Sa\nAs for Kilman, he is playable in the next three rounds, which includes a double-header in Gameweek 25. You can then bench him against Spurs and Newcastle, which needn’t be an issue given his £4.3m price tag. Up first for Wolves is Southampton, who lost 3-0 at Brentford last time out, a result which leaves them bottom of the division. That was Nathan Jones’ sixth defeat from seven league games in charge, a period that has seen them score just five goals, so there is real clean-sheet potential for Wolves this weekend. Owned by just 1.9% of managers, Kilman could be the perfect budget enabler at Wolves, at a time when team-mate Hugo Bueno’s (£3.9m) minutes are perhaps in doubt. Posted by"
}, {
	"title": "Who is the best captain for Double Gameweek 23?",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/who-is-the-best-captain-for-double-gameweek-23/",
	"text": "\nFantasy Premier League (FPL) managers brace themselves, once again, as reigning champions Manchester City and plucky title challengers Arsenal face off – and play twice – in Double Gameweek 23. The main event bears the hallmarks of a blockbuster, with its very own master and the apprentice sub-plot, and despite \n (£12.2m) appearing as the overwhelming armband favourite, we analyse the latest \n to solve the captaincy conundrum. As usual, the Captain Sensible article is here to highlight which assets have the best chance of hauling. First, we will assess the fallout of the captain poll, before then analysing the best options, Rate My Team (RMT) and the Premier Fantasy Tools ratings ahead of Saturday’s 11:00 GMT deadline. returns to the top of the captain poll in Double Gameweek 23 after a short break, backed by a mite over seven-tenths of the total votes cast by users at the time of writing. No other player has garnered more than 10% of votes at this stage, with\n(£8.3m)\ncurrently in second place, backed by just around one in 11 of our users. (£7.0m) occupies third place with 7.4% of the vote, followed by \n(£6.8m) and \n(£12.4m) further back. The summer arrival of\nwas proclaimed by all and sundry as the death of competition, with the realistic expectation that Manchester City’s dominance would be unassailable. Haaland has certainly brought goals, 25 goals in just 20 Premier League appearances to be exact, but the Norwegian’s ample returns have papered over the cracks as Guardiola’s side struggle to adapt from tiki-taka to target-man. Three blanks in Haaland’s last five Premier League matches have led to churlish suggestions that the Nordic sharpshooter is slightly out of form – but his recent hat-trick against Wolves is a stark reminder of his potential. Haaland’s shot volumes are down over the last six matches, with his 15 attempts bettered by 19 other players. The Norwegian places in the top four for big chances received (10) and expected goals (xG, 3.94) over that same period. However, four of Haaland’s five blanks this season have arrived away from home in high-pressure games against the following “big six” opposition – Liverpool, Chelsea, Manchester United and Tottenham Hotspur."
}, {
	"title": "Who is the best captain for Double Gameweek 23?",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/who-is-the-best-captain-for-double-gameweek-23/",
	"text": "However, four of Haaland’s five blanks this season have arrived away from home in high-pressure games against the following “big six” opposition – Liverpool, Chelsea, Manchester United and Tottenham Hotspur. dropped to the bench against Tottenham Hotspur in City’s last Premier League outing, with tactical reasons cited as justification for the demotion. De Bruyne is expected to return to the starting line-up against both Aston Villa and Arsenal who, unlike Spurs, typically play a more traditional back-four formation. The Belgian was sprung for the bench just before the 60\n minute against Spurs and created a match-leading three chances, highlighting the playmaker’s potential. De Bruyne’s 19 chances created, six big chances supplied, and 15 successful crosses all play in the division’s top three over the last six matches – which suggests that returns will come for City’s underperformer. Furthermore, City’s midfield maestro tops the charts for expected assists (xA, 3.15) and places a very respectable third for non-penalty involvement (NPxGI, 4.04) over that same period. (£7.7m) has undergone a timely revival as a Fantasy prospect ahead of Manchester City’s Double Gameweek 23 against Aston Villa and Arsenal. The mercurial Algerian – usually renowned for his unpredictable and unreliable expected minutes – has started six out of seven Premier League matches for Guardiola’s troops since Gameweek 17. A secure starting role and Mahrez’s natural ability are a potent combination, and City’s winger highlighted his high-ceiling potential in Double Gameweek 20. Mahrez scored two goals and supplied an assist against Tottenham Hotspur delivering a 17-point haul in the second fixture. Since the return to domestic action, Mahrez has registered seven attacking returns, netting three times and turning provider on four occasions, and the Algerian’s point tally (46) over that period is just two fewer than Erling Haaland. The underlying numbers highlight Mahrez’s all-round potential with his nine shots in the box, 15 chances created, and five big chances supplied all placing in the top three among City teammates since Gameweek 17. Manchester City’s immediate opponents Aston Villa are revitalised under the new stewardship of Unai Emery. Villa are in buoyant form, winning five of Emery’s first eight Premier League matches, but their defensive underlying numbers are a concern."
}, {
	"title": "Who is the best captain for Double Gameweek 23?",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/who-is-the-best-captain-for-double-gameweek-23/",
	"text": "Villa are in buoyant form, winning five of Emery’s first eight Premier League matches, but their defensive underlying numbers are a concern. Villa place in the bottom two over the last six matches for big chances conceded (20) and non-penalty expected goals conceded (NPxGC, 9.88). Arsenal host City in the second fixture of Double Gameweek 23 and Arteta’s rear-guard will offer a much sterner test. The Gunners have registered nine clean sheets this Premier League campaign, a total bettered by only Newcastle United (12), but bizarrely only two shut-outs have arrived at the Emirates Stadium. Over the last six matches, Arteta’s troops rank third-best for shots inside the box conceded (39) but sit around mid-table for big chances conceded (11) and shots on target against (25). However, the Gunners rank third-best for non-penalty expected goals conceded (NPxGC, 6.11) despite facing Newcastle United, Tottenham Hotspur and Manchester United over that six-game period. Author of Captain Sensible. I write Fantasy Premier League articles, focusing on stats and strategy. Three top 10k finishes. 21/22 Rank - 2783"
}, {
	"title": "FPL Double Gameweek 23 live team news: Friday injury updates",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-live-team-news-friday-injury-updates/",
	"text": "\nThere are 16 more pre-match press conferences to get through before Saturday’s Gameweek 23 deadline, following on from the four we had yesterday. As usual, we’ll be bringing you all the key quotes that you need for your Fantasy Premier League (FPL) teams. For the updates from the press conferences of Brendan Rodgers, Nathan Jones, Steve Cooper and Spurs assistant boss Cristian Stellini,\n(knee) remains out long term, while \n(knee) isn’t ready to feature competitively just yet. Mikel Arteta provided the latest on Jesus in his pre-match presser, with the comments suggesting that it’ll still be some time before we see the Brazilian. “Gabi is doing really well, he’s already been outside a little bit. Still early stages, he keeps pushing everybody, every single day, but we need to respect some timelines and some processes. But he’s doing really well. “Not yet [for a return date], I think it’s still too far off that. We have to see now when you start to put some load through that knee and start to get some movement and some actions that are not as controlled as the ones he’s been doing, how that knee reacts.” – Mikel Arteta\n (thigh) and \n (muscle) are back on the grass but also remain out. “The ones that were long-term – like Emile, Reiss and Gabriel Jesus – they are closer, they’ve started to do some activities and have been outside. But they are not ready yet to be contributing.” – Mikel Arteta\nFPL managers will likely go into Double Gameweek 23 without any Manchester City team news, as the broadcast section of Pep Guardiola’s press conference was almost entirely devoted to the recent Financial Fair Play story. The second section of Guardiola’s presser won’t follow until Saturday night. (hamstring) remains sidelined but \n \nbe back; he was on the cusp of a return from a foot injury but took ill ahead of the Spurs game and missed out. Foden has since been pictured in training. (knee) and \n(muscle) remain sidelined but Liverpool were handed a big boost this week when\n(hamstring), \n(muscle), \n(hamstring) and \n (calf) all returned to training."
}, {
	"title": "FPL Double Gameweek 23 live team news: Friday injury updates",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-live-team-news-friday-injury-updates/",
	"text": "(knee) and \n(muscle) remain sidelined but Liverpool were handed a big boost this week when\n(hamstring), \n(muscle), \n(hamstring) and \n (calf) all returned to training. Jota looks the closest to featuring in the Merseyside derby. “The players are back in training, still at different stages. “Diogo is the closest, he trains now normal already for two days. Another three days of training possible for him and then I think he’s in contention for the squad, I would say, but we have to wait a little bit. “Bobby, next one, I don’t know. We have to see how that looks now, how he deals with training intensity, stuff like this, and then we make a decision there. Arthur probably similar to Bobby, I would say. “Virgil, I don’t think is that close.” – Jurgen Klopp\nmissed out due to illness last weekend but has since rejoined training. however, is struggling with a hip injury and hasn’t trained all week. “Thiago has some problems, I know the problems but I have to ask the medical department what I am allowed to say first! “Hip flexor, stuff like this. He was not able to train.” – Jurgen Klopp\n(ankle), \n(knee) and \n(suspended) remain on the sidelines, while Erik ten Hag doesn’t expect to have any of his other injured players – namely \n(hip),\n (unspecified issue) and \n (leg) – back for the swift return match at Elland Road. “I don’t expect [them to be fit]. We have some days obviously, but I don’t expect it. If I can oversee it from now, I don’t see any new problems coming up.” – Erik ten Hag\nmissed the midweek game due to “illness” and it’s uncertain whether he’ll recover in time. (heel), \n(knee) and \n(knee) remain out, as does the suspended \nTargett is back on the grass but has yet to train fully with the Newcastle squad. is available, however, having sat out Gameweek 22 due to the concussion protocols. “Yes he will be [back in the squad]. He’s fully recovered, no problems. Initially, he got hit the ball on the head. He didn’t feel too bad but we had to follow [concussion] protocols."
}, {
	"title": "FPL Double Gameweek 23 live team news: Friday injury updates",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-live-team-news-friday-injury-updates/",
	"text": "He didn’t feel too bad but we had to follow [concussion] protocols. He’s been good this week.” – Eddie Howe on Alexander Isak\n‘s sub-par display in Gameweek 22 came in for some criticism but he looks set to again get the nod ahead of \n with Eddie Howe backing the Frenchman in his pre-match presser. “I think Maxi’s someone who probably performs with a consistent run of games, but I would say that would be the case for all players. So I think he has a window and an opportunity to impress. “I thought there were some aspects of his game that were in a really good place last week. I thought, most importantly, he tried to give his all for the team. I don’t think there was any lack of effort from him. “I thought West Ham managed him well in the game. Teams will always look at him as a big threat, and probably produce game plans on keeping him quiet. But it’s up to us and him to try and find a solution those game plans. “I’ve been really pleased with his attitude and how he’s worked this week. I think Maxi’s in a better place.” – Eddie Howe\n (muscle),\n(muscle) and \n (knee) remain out but \nis back from suspension and \n (knee) returns after initial fears of a serious injury subsided. “Colwill and Lallana can’t play but we knew that before this week and we have another couple of doubts. “Yes [Evan Ferguson cab play] but I have a doubt betwee Undav and Ferguson because Deniz Undav played very well. He knows when he has to play and when he has to attack the space, it is different to Evan. Evan is more stiker. He [Ferguson] knows better to attack the space to score, but in the quality of play, Deniz Undav is also very important.” – Roberto De Zerbi\n(ACL), \n (knee), \n (finger) and \n(hamstring) remain out, while the West Ham game very likely comes too soon for \n (thigh), \n(calf) and \n(knee) despite their returns to training. is also a doubt with a knock but\nis back from suspension."
}, {
	"title": "FPL Double Gameweek 23 live team news: Friday injury updates",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-live-team-news-friday-injury-updates/",
	"text": "is also a doubt with a knock but\nis back from suspension. “We had a little setback with Raheem, he had a kick in training so we’re assessing him. I think he’s probably doubtful for tomorrow I’d say. He just got a kick in training on the side of his knee.” – Graham Poter\n (hamstring) is “touch and go at best” to feature in Monday’s Merseyside derby. “We’re still monitoring him, he’ll be touch and go at best, I think, for the Liverpool game. We’ll just have to monitor it and hope that it settles down sooner rather than later. “He’s had a couple of niggly injuries as you know, getting on top of them, getting his body to adapt and all them things, for the longer term obviously. He put a real shift in [v Arsenal], his stats were very good. Unfortunately he’s just got a niggly hamstring. We’ve got to get on top of it as quick as we can.” – Sean Dyche\n(back) is back in full training, while \n(knee) has been on the grass this week as he completes individual rehab work. (suspension) has joined\n (ankle) and\n (knee) on the sidelines, while \n(knock), \n(knock) and\n (muscle) will be assessed. In his final presser as Leeds boss before his dismissal, Jesse Marsch told us that \n (ankle), \n(ankle) and \n(hip) were all closing in on a return – but interim manager Michael Skubala’s update below on the ‘long-term injuries’ suggests they’ll again miss out. “The long-term injuries are progressing well, they’re the same. “Pascal got concussion, the medical team are following the concussion protocols so he’ll miss the game on Sunday, which the right decision. Liam and Marc we’re still assessing, we’ll see if we can get them involved on Sunday, that’s taking a bit of time. Luis was a slightly different injury, we think he’ll be OK but we’re still going to assess whether it’s too early for him on Sunday. “Just some slight muscle injuries, really. For me, it’s about protecting playrs first and foremost. We don’t want to take any risks with any players, this is a long season and we need to look after them.” – Michael Skubala\nJulen Lopetegui will again be without \n (hamstring), \n(knee) and \n(knee) in Gameweek 23 but \n (ankle) is nearing a return after a long lay-off and has a chance of featuring in the squad this weekend."
}, {
	"title": "FPL Double Gameweek 23 live team news: Friday injury updates",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-live-team-news-friday-injury-updates/",
	"text": "We don’t want to take any risks with any players, this is a long season and we need to look after them.” – Michael Skubala\nJulen Lopetegui will again be without \n (hamstring), \n(knee) and \n(knee) in Gameweek 23 but \n (ankle) is nearing a return after a long lay-off and has a chance of featuring in the squad this weekend. (hamstring) is newly ruled out for 4-5 weeks and \n(knock) faces assessment, while one other unnamed player is “touch and go”. David Moyes said he isn’t expecting back \n (hip)\n(knee), \n(calf) and \n (hamstring) for the Chelsea match, while\n was substituted at half-time in Gameweek 22 with an unspecified issue and is a “problem” according to his manager. (knee) is available for the visit of Nottingham Forest but \n \n (shin) has failed to recover from the knock he picked up at Sunderland in midweek. Other than Cairney and long-term absentee\n (Achilles), the Cottagers have no other injury worries. Aston Villa are almost at a clean bill of health, with \n(unspecified) back in training following his recall from loan and \n (Achilles) set to follow suit as early as next week. There was seemingly no word on \n (hamstring) and \n (calf) in Patrick Vieira’s pre-match presser but if a past prognosis on Zaha was accurate (the Palace boss saying last week that he would be out for another fortnight), we can’t expect to see him for the M23 derby. Vieira did confirm that \n will be part of the Palace squad for the first time this season, after the veteran midfielder returned to training recently following a seven-month lay-off. has also trained for a few weeks without any setbacks, although it’s not clear whether he’ll be considered for competitive action just yet. (hamstring) and\n (hamstring) are still not ready for competitive football despite nearing a return from injury, while \n (ankle) has joined them on the sidelines for the Arsenal game. (hamstring) will be a late call due to a hamstring injury, while \n (knee), \n (hamstring), \n (calf) and \n(ankle) will all miss the visit of Newcastle. Gary O’Neil said on Friday that \n(muscle),\n (muscle),\n(knee) and \n (hamstring) had either “trained well” or “had a good week” but stopped short of declaring them available for selection, admitting that some had only been doing modified training."
}, {
	"title": "FPL Double Gameweek 23 live team news: Friday injury updates",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/fpl-double-gameweek-23-live-team-news-friday-injury-updates/",
	"text": "Gary O’Neil said on Friday that \n(muscle),\n (muscle),\n(knee) and \n (hamstring) had either “trained well” or “had a good week” but stopped short of declaring them available for selection, admitting that some had only been doing modified training. Indeed, of the walking wounded, only Stanislas and Gameweek 22 absentee \n(calf) were spotted in team training footage this week. O’Neil has got very little in reserve if all of those names miss out but at least the XI he sent out against Brighton turned in a good shift, with the Seagulls pushed all the way for their late victory. will be on standby to deputise for Billing if he misses out. Neale is the Editor of Fantasy Football Scout."
}, {
	"title": "FPL review: Arteta on Martinelli, Almiron injury update",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/11/fpl-review-arteta-on-martinelli-almiron-injury-update/",
	"text": "\nWe assess the key Fantasy Premier League (FPL) talking points from two Gameweek 23 matches, Arsenal v Brentford and Bournemouth v Newcastle United. The numbers you see in this article are taken from our \n, where you can access Opta player and team data for every single Premier League fixture. (£6.6m) blanked for the fifth match in a row on Saturday, being hooked around the hour mark for the second Gameweek running as replacement \n (£6.7m) came off the bench to score. All this clock-watching isn’t good for the health and the fact that Martinelli’s owners were just relieved to see the 60-minute mark pass before his withdrawal, in order to see him pick up two extra points, shows how much his appeal has been dented recently. “Not particularly bad but a long way off his scintillating best. Looks to be missing Gabriel Jesus.” – Football London’s write-up of Gabriel Martinelli’s performance\nMartinelli wasn’t atrocious, as the succinct summary above points out, but he’s now got the misfortune of being one of the only Arsenal regulars with a top-class back-up/positional rival waiting in the wings. Since Trossard’s arrival, Martinelli has played 200 minutes to \n‘s (£8.3m) 270. It was Saka who provided the assist for Trossard’s goal, with the England international’s six FPL points feeling like a good return in this low-scoring Gameweek so far. The winger also had more shots (seven) than Martinelli, \n(£7.0m) and a quiet \n (£6.8m) put together. “I think every player has got their moment. We took Gabi off for Leo because when Leo’s in those spaces, he’s so good. He’s so composed, he’s constantly faking movements, playing forwards, he’s got a smell for where the ball is going to land, and we believe it was the right choice to get him on today.” – Mikel Arteta on Gabriel Martinelli\nMikel Arteta has kept unenforced changes to an absolute minimum this season, with Martinelli, Saka and Odegaard among the 10 Gunners who’ve started every league match that they’ve been available for. After the game, the Arsenal boss was asked whether he is considering the possibility of fatigue creeping in without any rotation in the line-up:\n“We always thought about that, and with a few players, especially when you lose but those questions are always obviously when you drop a point or two points."
}, {
	"title": "FPL review: Arteta on Martinelli, Almiron injury update",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/11/fpl-review-arteta-on-martinelli-almiron-injury-update/",
	"text": "After the game, the Arsenal boss was asked whether he is considering the possibility of fatigue creeping in without any rotation in the line-up:\n“We always thought about that, and with a few players, especially when you lose but those questions are always obviously when you drop a point or two points. I’m delighted to be fair with how the boys tried, how much they want it. With the players that we have, we try to maximise our resources, so far they’ve done really well.” – Mikel Arteta\nArsenal did rack up more shots than any other Premier League team on Saturday (23) but few of them were clear-cut, with Trossard’s goal the only ‘big chance’ logged by Opta. however, an in-form, unbeaten-in-ten Brentford have become a tough nut to crack, and much easier tests await the Gunners in the weeks and months to come. Don’t press the panic button just yet. Brentford have now scored against all seven of the teams above them in the league table this season, with \n(£7.6m) plundering eight goals of his own against these clubs – that’s over half of his 2022/23 total. The in-form Bees now don’t encounter any big-six side until Gameweek 33, unless their outstanding fixture against Manchester United is added to the schedule before then. Their upcoming ‘double’ in Gameweek 27 is also hugely enticing, although there is that pesky blank in Gameweek 25 and \nOne other thing that’s worth mentioning is that Toney was spotted rubbing his hamstring when being substituted late in the game at the Emirates, although this could well have been part of the gamesmanship/dark arts \nNewcastle extended their unbeaten run to 17 league matches but it was another uninspiring draw for the Magpies, their fifth in six matches – four of which have been against sides in the bottom half. Bournemouth arguably merited the victory more, too, with\n (£6.1m) clearing off the line late on to preserve a point. “A lot of effort but not the quality. “We’ve had a few half-chances but we lacked that killer instinct today, we weren’t as free flowing in the final third as we have been.” – Eddie Howe\nThe impact of \n(£5.6m) absence \nand Eddie Howe’s side were again below par at both ends of the field at the Vitality Stadium."
}, {
	"title": "FPL review: Arteta on Martinelli, Almiron injury update",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/11/fpl-review-arteta-on-martinelli-almiron-injury-update/",
	"text": "“We’ve had a few half-chances but we lacked that killer instinct today, we weren’t as free flowing in the final third as we have been.” – Eddie Howe\nThe impact of \n(£5.6m) absence \nand Eddie Howe’s side were again below par at both ends of the field at the Vitality Stadium. It’d be human nature to have one eye on the upcoming EFL Cup final, too, and the subconscious or conscious bid to avoid injury for a rare old trip to Wembley. That didn’t stop the fitness issues from racking up on Saturday evening. Newcastle went into the game without \n(£7.1m) because of a hamstring strain, while the Magpies lost \n (£4.7m), \n (£5.7m) and \n (£6.1m) to hamstring, wrist and knee injuries respectively during the match. Luckily for Howe and his thin Newcastle squad, only Willock’s problem seems to be causing concern. “Miggy and Maxi I don’t think are too bad. Miggy, I think got a stamp on his hand, so I think he’ll be OK. Maxi, I think, was just a knock. The concern from today is Joe Willock who has a hamstring problem. We’ll see how he is. “Callum’s just got a very minor hamstring complaint. We hope to get him back for the next one. Fingers crossed.” – Eddie Howe\nAlmiron was the most-sold FPL midfielder of Gameweek 23 and there was an inevitability that he would end his five-match points drought, although wounded sellers will still point to the fact that his equalising goal against Bournemouth was his only shot of the game and his first ‘big chance’ in six Gameweeks. As for the Cherries, there have been three improved performances in a row now, helped by some fresh acquisitions and the return from injury of some key names. Only a late, late Brighton goal in Gameweek 22 has stopped them from stringing together a three-match unbeaten run. But only rabid Bournemouth fans will be snapping up their players for the upcoming run, so the few mentions of them in FPL circles will chiefly concern how much of a whipping boy we think they still are for our prospective Gameweek 25-27 captains."
}, {
	"title": "FPL review: Arteta on Martinelli, Almiron injury update",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/11/fpl-review-arteta-on-martinelli-almiron-injury-update/",
	"text": "But only rabid Bournemouth fans will be snapping up their players for the upcoming run, so the few mentions of them in FPL circles will chiefly concern how much of a whipping boy we think they still are for our prospective Gameweek 25-27 captains. Neale is the Editor of Fantasy Football Scout."
}, {
	"title": "Mark Sutherns’ FPL Gameweek 23 preview and team reveal",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/mark-sutherns-fpl-gameweek-23-preview-and-team-reveal/",
	"text": "\n joins \n for another exclusive video for \nThe pair will be chatting on our YouTube channel about their own teams and how they’re approaching Double Gameweek 23 of Fantasy Premier League (FPL). They’ll no doubt be reacting to the \n too, whilst perhaps discussing whether any remaining Triple Captain chips should go on \n (£12.2m) this week. Mark and Andy are live from 20:00 GMT, with the stream watchable via the embedded video below. And if you’ve missed the start or indeed the whole of the live broadcast, you can of course still watch the stream back from the start in its entirety. Only Premium Members of Fantasy Football Scout will be able to watch the video below, so \nto get access to not just this stream but also exclusive YouTube content from Mark throughout the 2022/23 campaign. Newcastle fan that spends far too much time thinking about FPL."
}, {
	"title": "The FPL Watchlist: Who are the best medium-term player picks?",
	"url": "https://www.fantasyfootballscout.co.uk/2023/02/10/the-fpl-watchlist-who-are-the-best-medium-term-player-picks-12/",
	"text": "\nWhile our Scout Picks deal in a one-week-only window, our Watchlist series concentrates on the (more important!) medium-term outlook in Fantasy Premier League (FPL). In this feature, we look at the stand-out FPL and Draft options over a four-to-six-week lookahead. We try to be less ‘kneejerk’ in these articles as a result, given that we’ve identified targets for a more sustained period. And what muddied waters lie ahead, with a Blank and/or Double Gameweek in four of the next six rounds following \nPlayers are selected and ranked according to factors such as form, club injuries, forthcoming fixtures, \n and whether or not the player in question is likely to be a bargain in FPL. Arrows before the name indicate whether a player has climbed or fallen in our reckoning since the previous update or if they are a new entry into the tables. We typically toe the line with FPL’s definition of ‘form’ (average points accrued in matches played over the last 30 days) but with few matches actually played over that time, we’ve extended it slightly back to the beginning of 2023. The key for the factors you’ll see in the below tables is as follows:\nDespite goalkeepers doubling all around him, \n (£4.6m) climbs back to the top of the pecking order and may well remain there for much of the run-in. He had only dropped down due to a recent ‘tough’ run of games (Manchester City, Liverpool and two encounters with a formerly free-scoring Fulham) but he’s a set-and-forget dream for the medium term, with seven of Chelsea’s next eight fixtures against sides in the bottom half. Even better, Kepa – who averages more points per match (5.6) than any other regular starter between the sticks – plays for one of just seven clubs who\ndon’t blank in Gameweeks 25 and 28. Sheer volume of fixtures – eight in the next six Gameweeks – is the driving force behind \n‘s (£4.9m) climb to second, even if he’s not in the shake-up of most FPL managers’ Arsenal triple-ups. Nevertheless, he’s a country mile ahead of other shot-stoppers for \nin Gameweeks 23-28."
}]